; domain
(define (domain blocks)

    (:requirements :strips :typing)

    (:types block)

    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty)
        (holding ?x - block)
    )

    (:action pick-up
        :parameters (?x - block)
        :precondition (and (clear ?x) (ontable ?x) (handempty))
        :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x))
    )

    (:action put-down
        :parameters (?x - block)
        :precondition (holding ?x)
        :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x))
    )

    (:action stack
        :parameters (?x - block ?y - block)
        :precondition (and (holding ?x) (clear ?y))
        :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y))
    )

    (:action unstack
        :parameters (?x - block ?y - block)
        :precondition (and (on ?x ?y) (clear ?x) (handempty))
        :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y)))
    )
)

; problem
(define (problem blocks-prob-2)
  (:domain blocks)

  (:objects
    b1 - block
    b2 - block
    b3 - block
    b4 - block
    b5 - block
  )

  (:init
    (ontable b5)
    (on b3 b5)
    (ontable b1)
    (ontable b4)
    (ontable b2)
    (clear b3)
    (clear b1)
    (clear b4)
    (clear b2)
    (handempty)
  )

  (:goal (and
    (ontable b3)
    (on b1 b3)
    (on b2 b1)
    (on b4 b2)
    (on b5 b4)
  ))
)

; plan
1. (unstack b3 b5)
   deleted: (clear b3) (handempty) (on b3 b5)
   added: (holding b3) (clear b5)
   goals met: 0 of 5
2. (put-down b3)
   deleted: (holding b3)
   added: (clear b3) (handempty) (ontable b3)
   goals met: 1 of 5
3. (pick-up b1)
   deleted: (ontable b1) (clear b1) (handempty)
   added: (holding b1)
   goals met: 1 of 5
4. (stack b1 b3)
   deleted: (holding b1) (clear b3)
   added: (clear b1) (handempty) (on b1 b3)
   goals met: 2 of 5
5. (pick-up b2)
   deleted: (ontable b2) (clear b2) (handempty)
   added: (holding b2)
   goals met: 2 of 5
6. (stack b2 b1)
   deleted: (holding b2) (clear b1)
   added: (clear b2) (handempty) (on b2 b1)
   goals met: 3 of 5
7. (pick-up b4)
   deleted: (ontable b4) (clear b4) (handempty)
   added: (holding b4)
   goals met: 3 of 5
8. (stack b4 b2)
   deleted: (holding b4) (clear b2)
   added: (clear b4) (handempty) (on b4 b2)
   goals met: 4 of 5
9. (pick-up b5)
   deleted: (ontable b5) (clear b5) (handempty)
   added: (holding b5)
   goals met: 4 of 5
10. (stack b5 b4)
   deleted: (holding b5) (clear b4)
   added: (clear b5) (handempty) (on b5 b4)
   goals met: 5 of 5
